#+title: Zrównoleglenie wstępnego przetwarzania danych przy użyciu OpenMP
#+AUTHOR:  Karol Wójcik, Filip Krzysiek
#+DATE: 2020-10-14, Wtorek
#+LANGUAGE: pl
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+OPTIONS: toc:nil

#+begin_export latex
  \clearpage \tableofcontents \clearpage
#+end_export

*** Pomiar A
#+BEGIN_SRC sh :results output :exports results :eval yes
  make run_min_max_no_omp_bench
#+end_src

#+RESULTS:
: g++ src/min_max.cpp -o min_max_no_omp
:
: Mean exec time for benches of op: 'DS->MinMaxDS' 180.7 ms
: Mean exec time for benches of op: 'MAX op' 2.14444 ms
: Mean exec time for benches of op: 'MIN op' 2.17778 ms

*** Pomiar B
#+BEGIN_SRC sh :results output :exports results :eval yes
  make run_min_max_bench
#+end_src

#+RESULTS:
: g++ -fopenmp src/min_max.cpp -o min_max
:
: Mean exec time for benches of op: 'DS->MinMaxDS' 163.3 ms
: Mean exec time for benches of op: 'MAX op' 0.922222 ms
: Mean exec time for benches of op: 'MIN op' 0.866667 ms

*** Pomiar C
#+BEGIN_SRC sh :results output :exports results :eval yes
python3 min_max.py
#+end_src

#+RESULTS:
: Mean of elapsed time for 30 execs took 77.21493699991697 ms

#+begin_export latex
\clearpage
#+end_export
*** Pomiar A
#+BEGIN_SRC sh :results output :exports results :eval yes
  make run_standard_scaler_no_omp_bench
#+end_src

#+RESULTS:
: g++ src/standard_scaler.cpp -o standard_scaler_no_omp
:
: Mean exec time for benches of op: 'DS->StandardScalerDS' 196.967 ms
: Mean exec time for benches of op: 'MEAN op' 2.2 ms
: Mean exec time for benches of op: 'STD op' 7.07778 ms

*** Pomiar B
#+BEGIN_SRC sh :results output :exports results :eval yes
  make run_standard_scaler_bench
#+end_src

#+RESULTS:
: g++ -fopenmp src/standard_scaler.cpp -o standard_scaler
:
: Mean exec time for benches of op: 'DS->StandardScalerDS' 159.567 ms
: Mean exec time for benches of op: 'MEAN op' 2.37778 ms
: Mean exec time for benches of op: 'STD op' 0.833333 ms

*** Pomiar C
#+BEGIN_SRC sh :results output :exports results :eval yes
python3 standard_scaler.py
#+end_src

#+RESULTS:
: Mean of elapsed time for 30 execs took 83.95475529996475 ms

#+begin_export latex
\clearpage
#+end_export

